spec/cassettes/StripeWrapper/StripeWrapper_Charge/_create/creates_a_card_denied_.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/tokens
    body:
      encoding: US-ASCII
      string: card[number]=4000000000000002&card[exp_month]=7&card[exp_year]=2016&card[cvc]=314
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.23.0
      Authorization:
      - Bearer sk_test_yraDvIWvJWJgs3LbHayQw1Os
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.23.0","lang":"ruby","lang_version":"2.1.6 p336 (2015-04-13)","platform":"i686-linux","engine":"ruby","publisher":"stripe","uname":"Linux
        version 3.8.0-33-generic (buildd@lamiak) (gcc version 4.6.3 (Ubuntu/Linaro
        4.6.3-1ubuntu5) ) #48~precise1-Ubuntu SMP Thu Oct 24 16:31:16 UTC 2013","hostname":"treehouse"}'
      Content-Length:
      - '81'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Fri, 31 Jul 2015 16:18:56 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '780'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_6i6QEMyTulgAX2
      Stripe-Version:
      - '2015-07-13'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "tok_16UgDkEEmXoFagV2WgcmKPhx",
          "livemode": false,
          "created": 1438359536,
          "used": false,
          "object": "token",
          "type": "card",
          "card": {
            "id": "card_16UgDkEEmXoFagV2yv8tKvSH",
            "object": "card",
            "last4": "0002",
            "brand": "Visa",
            "funding": "credit",
            "exp_month": 7,
            "exp_year": 2016,
            "fingerprint": "dFlojXKzldj2EgIA",
            "country": "US",
            "name": null,
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null,
            "cvc_check": "unchecked",
            "address_line1_check": null,
            "address_zip_check": null,
            "tokenization_method": null,
            "dynamic_last4": null,
            "metadata": {}
          },
          "client_ip": "83.55.209.106"
        }
    http_version: 
  recorded_at: Fri, 31 Jul 2015 16:18:56 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/charges
    body:
      encoding: US-ASCII
      string: amount=999&currency=eur&source=tok_16UgDkEEmXoFagV2WgcmKPhx&description=test%20charge
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.23.0
      Authorization:
      - Bearer sk_test_yraDvIWvJWJgs3LbHayQw1Os
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.23.0","lang":"ruby","lang_version":"2.1.6 p336 (2015-04-13)","platform":"i686-linux","engine":"ruby","publisher":"stripe","uname":"Linux
        version 3.8.0-33-generic (buildd@lamiak) (gcc version 4.6.3 (Ubuntu/Linaro
        4.6.3-1ubuntu5) ) #48~precise1-Ubuntu SMP Thu Oct 24 16:31:16 UTC 2013","hostname":"treehouse"}'
      Content-Length:
      - '85'
  response:
    status:
      code: 402
      message: Payment Required
    headers:
      Server:
      - nginx
      Date:
      - Fri, 31 Jul 2015 16:19:02 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '162'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_6i6QvXKODesyNv
      Stripe-Version:
      - '2015-07-13'
    body:
      encoding: UTF-8
      string: |
        {
          "error": {
            "message": "Your card was declined.",
            "type": "card_error",
            "code": "card_declined",
            "charge": "ch_16UgDqEEmXoFagV2Q0AkNuuI"
          }
        }
    http_version: 
  recorded_at: Fri, 31 Jul 2015 16:19:02 GMT
recorded_with: VCR 2.9.3
